# Pandas series

In [1]:
import pandas as pd

In [2]:
dataset= pd.read_csv("Campus_Placement_Tracker_500.csv")

In [3]:
dataset

,Roll Number,First Name,Last Name,Gender,Branch,Company,CTC (LPA),Job Role
0,22BCE6764,Shruti,Gupta,Female,Civil,Capgemini,3.43,Software Engineer
1,22BCE1856,Dev,Sharma,Male,Mechanical,Cognizant,5.63,Data Analyst
2,22BCE7769,Dev,Pandey,Male,ECE,TCS,4.17,Software Engineer
3,22BCE3591,Atharv,Mehta,Female,ECE,Infosys,3.42,DevOps Engineer
4,22BCE2533,Sai,Agarwal,Male,Civil,TCS,3.14,DevOps Engineer
...,...,...,...,...,...,...,...,...
495,22BCE9836,Aarav,Verma,Male,EEE,Google,21.62,Backend Developer
496,22BCE3684,Dev,Joshi,Female,Civil,Wipro,13.19,Data Analyst
497,22BCE3357,Ishaan,Reddy,Female,Civil,Google,12.04,DevOps Engineer
498,22BCE6715,Kritika,Kapoor,Male,IT,TCS,20.80,System Analyst
499,22BCE7062,Arjun,Kapoor,Male,Mechanical,Google,22.68,System Analyst

In [4]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Roll Number  500 non-null    object
 1   First Name   500 non-null    object
 2   Last Name    500 non-null    object
 3   Gender       500 non-null    object
 4   Branch       500 non-null    object
 5   Company      500 non-null    object
 6   CTC (LPA)    500 non-null    float64
 7   Job Role     500 non-null    object
dtypes: float64(1), object(7)
memory usage: 31.4+ KB

In [5]:
dataset["Job Role"]

0      Software Engineer
1           Data Analyst
2      Software Engineer
3        DevOps Engineer
4        DevOps Engineer
             ...
495    Backend Developer
496         Data Analyst
497      DevOps Engineer
498       System Analyst
499       System Analyst
Name: Job Role, Length: 500, dtype: object

In [6]:
type(dataset["Job Role"])

pandas.core.series.Series

In [11]:
dataset["Company"].equals(dataset.Company)

True

In [13]:
Branch = dataset["Branch"]

In [14]:
dataset.head()

,Roll Number,First Name,Last Name,Gender,Branch,Company,CTC (LPA),Job Role
0,22BCE6764,Shruti,Gupta,Female,Civil,Capgemini,3.43,Software Engineer
1,22BCE1856,Dev,Sharma,Male,Mechanical,Cognizant,5.63,Data Analyst
2,22BCE7769,Dev,Pandey,Male,ECE,TCS,4.17,Software Engineer
3,22BCE3591,Atharv,Mehta,Female,ECE,Infosys,3.42,DevOps Engineer
4,22BCE2533,Sai,Agarwal,Male,Civil,TCS,3.14,DevOps Engineer

In [15]:
dataset.tail()

,Roll Number,First Name,Last Name,Gender,Branch,Company,CTC (LPA),Job Role
495,22BCE9836,Aarav,Verma,Male,EEE,Google,21.62,Backend Developer
496,22BCE3684,Dev,Joshi,Female,Civil,Wipro,13.19,Data Analyst
497,22BCE3357,Ishaan,Reddy,Female,Civil,Google,12.04,DevOps Engineer
498,22BCE6715,Kritika,Kapoor,Male,IT,TCS,20.80,System Analyst
499,22BCE7062,Arjun,Kapoor,Male,Mechanical,Google,22.68,System Analyst

In [18]:
Branch.dtype

dtype('O')

In [19]:
Branch.shape

(500,)

In [20]:
len(Branch)

500

In [21]:
Branch.index

RangeIndex(start=0, stop=500, step=1)

In [22]:
Branch.info()

<class 'pandas.core.series.Series'>
RangeIndex: 500 entries, 0 to 499
Series name: Branch
Non-Null Count  Dtype
--------------  -----
500 non-null    object
dtypes: object(1)
memory usage: 4.0+ KB

In [23]:
Branch.to_frame()

         Branch
0         Civil
1    Mechanical
2           ECE
3           ECE
4         Civil
..          ...
495         EEE
496       Civil
497       Civil
498          IT
499  Mechanical

[500 rows x 1 columns]